### **_Pandas_**
#### Pandas is an open source library which provides high-performance, easy-to-use data structures and data analysis tools for the Python programming language. Pandas has a lot of functions that will help in reading and writing data and also for data manipulation. Thus we will be using pandas throughout the course.

In [1]:
#Import Pandas
import pandas as pd
import numpy as np

#Loading data with read_csv() function. Here we are providing path to the csv file. 
#If the file is in your system you can provide its path as well.
iris = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data", header=None)

## Series
#### Series it is 1D array capable of holding of any type of data type(integer , string, float etc)
or we can say that pandas series is nothing but a column in an excel sheet

In [2]:
## Creating a Series
series = pd.Series() # Creating an empty series
print(series)
columnElements = np.array([1,2,3,4])

series = pd.Series(columnElements)
series

Series([], dtype: float64)

<ipython-input-2-584e3a63180f>:2: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  series = pd.Series() # Creating an empty series

0    1
1    2
2    3
3    4
dtype: int64

## DataFrame
#### It is a 2D Size Mutable , tabular data structure with label axis(rows, columns)

In [3]:
#creating DataFrame

# intialise data of lists.
data = {'Name':['Tom', 'nick', 'krish', 'jack'],
        'Age':[20, 21, 19, 18]}
 
# Create DataFrame
df = pd.DataFrame(data)
 
# Print the output.
df

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

In [4]:
## adding new column 
df['WorkDone'] = ['Yes','No','No','Yes']
df

    Name  Age WorkDone
0    Tom   20      Yes
1   nick   21       No
2  krish   19       No
3   jack   18      Yes

In [5]:
## selecting Multiple Column
df[['Name','WorkDone']]

    Name WorkDone
0    Tom      Yes
1   nick       No
2  krish       No
3   jack      Yes

In [6]:
## replace  
df['Name'].replace(to_replace='nick',value='nicky') 
print(df)
df['Name'].replace(to_replace='nick',value='nicky',inplace=True) ## if inplace is false then it will not replace in original df
df

    Name  Age WorkDone
0    Tom   20      Yes
1   nick   21       No
2  krish   19       No
3   jack   18      Yes

    Name  Age WorkDone
0    Tom   20      Yes
1  nicky   21       No
2  krish   19       No
3   jack   18      Yes

In [7]:
## save df into csv format
df.to_csv('dataframe.csv',index=False)

In [8]:
# Working With iris datasets
type(iris)

pandas.core.frame.DataFrame

In [9]:
iris.head() ##print first 5 elements of df

     0    1    2    3            4
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa

In [10]:
#shape tells us about the shape of the structure.
print(iris.shape)
#dtypes will tell you type of data each column is storing
print(iris.dtypes)

(150, 5)
0    float64
1    float64
2    float64
3    float64
4     object
dtype: object

In [11]:
iris.describe()

                0           1           2           3
count  150.000000  150.000000  150.000000  150.000000
mean     5.843333    3.054000    3.758667    1.198667
std      0.828066    0.433594    1.764420    0.763161
min      4.300000    2.000000    1.000000    0.100000
25%      5.100000    2.800000    1.600000    0.300000
50%      5.800000    3.000000    4.350000    1.300000
75%      6.400000    3.300000    5.100000    1.800000
max      7.900000    4.400000    6.900000    2.500000

In [12]:
#Column Headers
iris.columns  # Will tell you what the current column headers are
#Changing Column Headers
iris.columns = ['sl','sw','pl','pw','flower_type']
iris.head()

    sl   sw   pl   pw  flower_type
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa

In [13]:
iris.isnull().sum()
## these means that we don't have any null value

sl             0
sw             0
pl             0
pw             0
flower_type    0
dtype: int64

In [14]:
## iloc vs loc
## iloc is index based searchng and loc is based on lables(row name)
data = pd.read_csv("dataframe.csv", index_col ="Name") 
  
# retrieving rows by loc method 
rows_based_loc = data.loc["nicky"] 
rows_based_iloc = data.iloc[1]
print(rows_based_loc)
print(rows_based_iloc)

Age         21
WorkDone    No
Name: nicky, dtype: object
Age         21
WorkDone    No
Name: nicky, dtype: object

In [15]:
print(data)
def change(row):
    if row =='Yes':
        return 1
    else:
        return 0


## Apply 
data['WorkDone'] = data['WorkDone'].apply(change)
data

## mostly used to deal with string

       Age WorkDone
Name
Tom     20      Yes
nicky   21       No
krish   19       No
jack    18      Yes

       Age  WorkDone
Name
Tom     20         1
nicky   21         0
krish   19         0
jack    18         1

In [16]:
#No changes have been made because drop function does not delete the rows from the original dataframe. 
#It creates a copy of the dataframe and returns the updated copy

#To make changes in the original dataframe we need to pass a inplace=True argument. This ensures that the changes are made 
#in the original dataset

iris.drop(0, inplace=True)
iris.head()

    sl   sw   pl   pw  flower_type
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa
5  5.4  3.9  1.7  0.4  Iris-setosa

In [18]:
iris.iloc[2:4, 1:3] = np.nan
print(iris.head())

#To fill the nan entries, fillna function is used
#There are several ways to fill the nan entries

iris.sw.fillna(iris.sw.mean(), inplace=True)
print(iris.head())
print("\n")

iris.pl.fillna(iris.pl.mean(), inplace=True)
print(iris.head())

    sl   sw   pl   pw  flower_type
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  NaN  NaN  0.2  Iris-setosa
4  5.0  NaN  NaN  0.2  Iris-setosa
5  5.4  3.9  1.7  0.4  Iris-setosa
    sl        sw   pl   pw  flower_type
1  4.9  3.000000  1.4  0.2  Iris-setosa
2  4.7  3.200000  1.3  0.2  Iris-setosa
3  4.6  3.046939  NaN  0.2  Iris-setosa
4  5.0  3.046939  NaN  0.2  Iris-setosa
5  5.4  3.900000  1.7  0.4  Iris-setosa


    sl        sw        pl   pw  flower_type
1  4.9  3.000000  1.400000  0.2  Iris-setosa
2  4.7  3.200000  1.300000  0.2  Iris-setosa
3  4.6  3.046939  3.806122  0.2  Iris-setosa
4  5.0  3.046939  3.806122  0.2  Iris-setosa
5  5.4  3.900000  1.700000  0.4  Iris-setosa